Revit 2024 API
Sketch Class
 Provides access to the Sketch in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Sketch : SketchBase
Visual Basic
Public Class Sketch _
	Inherits SketchBase
Visual C++
public ref class Sketch : public SketchBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SketchBase
 Autodesk.Revit.DB.Sketch
See Also
Sketch Members
Autodesk.Revit.DB Namespace